tap "homebrew/bundle"
brew "coreutils"
brew "asdf"
brew "eza"
brew "gh"
brew "git"
brew "peco"
brew "starship"
brew "swiftlint"
cask "android-studio"
cask "brave-browser"
cask "font-monaspace-nerd-font"
cask "google-japanese-ime"
cask "raycast"
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "angular.ng-template"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "natqe.reload"
vscode "oderwat.indent-rainbow"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "typespec.typespec-vscode"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "yoavbls.pretty-ts-errors"
