tap "homebrew/bundle"
brew "gh"
brew "git"
brew "mise"
brew "peco"
brew "starship"
brew "vim"
cask "brave-browser"
cask "docker"
cask "firefox@nightly"
cask "font-monaspace-nerd-font"
cask "github-copilot-for-xcode"
cask "google-chrome@canary"
cask "jetbrains-toolbox"
cask "microsoft-edge@canary"
cask "raycast"
cask "safari-technology-preview"
cask "visual-studio-code"
vscode "angular.ng-template"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "natizyskunk.sftp"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "typespec.typespec-vscode"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
