adpyke.codesnap
angular.ng-template
bierner.markdown-mermaid
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.vscode-js-profile-flame
ms-vscode.vscode-typescript-next
natqe.reload
oderwat.indent-rainbow
rangav.vscode-thunder-client
rust-lang.rust-analyzer
simonsiefke.svg-preview
streetsidesoftware.code-spell-checker
typespec.typespec-vscode
usernamehw.errorlens
vitest.explorer
yoavbls.pretty-ts-errors
